docs: udpate document with new source
